## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 5 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| update | `aws_alb_listener.notification-canada-ca`       |
|        | `aws_lb_listener_rule.api-host-route`           |
|        | `aws_lb_listener_rule.document-api-host-route`  |
|        | `aws_lb_listener_rule.document-host-route`      |
|        | `aws_lb_listener_rule.documentation-host-route` |
| add    | `aws_alb_target_group.admin_secondary`          |
|        | `aws_alb_target_group.api_secondary`            |
|        | `aws_alb_target_group.doc_api_secondary`        |
|        | `aws_alb_target_group.document_secondary`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_alb_listener.notification-canada-ca will be updated in-place
  ~ resource "aws_alb_listener" "notification-canada-ca" {
        id                = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c"
        tags              = {}
        # (7 unchanged attributes hidden)

      ~ default_action {
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-canada-ca-alb-admin/f840461ae7a91ff0" -> null
            # (2 unchanged attributes hidden)

          + forward {

              + target_group {
                  + arn    = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-canada-ca-alb-admin/f840461ae7a91ff0"
                  + weight = 1
                }
              + target_group {
                  + arn    = (known after apply)
                  + weight = 1
                }
            }
        }
    }

  # aws_alb_target_group.admin_secondary will be created
  + resource "aws_alb_target_group" "admin_secondary" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "admin-secondary"
      + port                               = 6012
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-097508d1f5e243195"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/_status?simple=true"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_alb_target_group.api_secondary will be created
  + resource "aws_alb_target_group" "api_secondary" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "k8s-api-secondary"
      + port                               = 6011
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-097508d1f5e243195"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/_status?simple=true"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_alb_target_group.doc_api_secondary will be created
  + resource "aws_alb_target_group" "doc_api_secondary" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "doc-api-secondary"
      + port                               = 7000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-097508d1f5e243195"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/_status"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_alb_target_group.document_secondary will be created
  + resource "aws_alb_target_group" "document_secondary" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "document-secondary"
      + port                               = 7001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-097508d1f5e243195"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/_status"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

  # aws_lb_listener_rule.api-host-route will be updated in-place
  ~ resource "aws_lb_listener_rule" "api-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener-rule/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c/4abd826a1993de30"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-canada-ca-alb-api/78a926c7209e046e" -> null
            # (2 unchanged attributes hidden)

          + forward {

              + target_group {
                  + arn    = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-canada-ca-alb-api/78a926c7209e046e"
                  + weight = 1
                }
              + target_group {
                  + arn    = (known after apply)
                  + weight = 1
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener_rule.document-api-host-route will be updated in-place
  ~ resource "aws_lb_listener_rule" "document-api-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener-rule/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c/02dc624427b8e4ef"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-document-api/f3059ddbe05de399" -> null
            # (2 unchanged attributes hidden)

          + forward {

              + target_group {
                  + arn    = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-document-api/f3059ddbe05de399"
                  + weight = 1
                }
              + target_group {
                  + arn    = (known after apply)
                  + weight = 1
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener_rule.document-host-route will be updated in-place
  ~ resource "aws_lb_listener_rule" "document-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener-rule/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c/23ebdbdef695afc3"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-document-api/f3059ddbe05de399" -> null
            # (2 unchanged attributes hidden)

          + forward {

              + target_group {
                  + arn    = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-document-api/f3059ddbe05de399"
                  + weight = 1
                }
              + target_group {
                  + arn    = (known after apply)
                  + weight = 1
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_listener_rule.documentation-host-route will be updated in-place
  ~ resource "aws_lb_listener_rule" "documentation-host-route" {
        id           = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:listener-rule/app/notification-staging-alb/81d71deedddc8281/ba77ef4a4a4c2e7c/fab0112c4061a1a5"
        tags         = {}
        # (4 unchanged attributes hidden)

      ~ action {
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-documentation/8c5b4c1e7c439ae9" -> null
            # (2 unchanged attributes hidden)

          + forward {

              + target_group {
                  + arn    = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:targetgroup/notification-documentation/8c5b4c1e7c439ae9"
                  + weight = 1
                }
              + target_group {
                  + arn    = (known after apply)
                  + weight = 1
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 5 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.admin_secondary"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.api_secondary"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.doc_api_secondary"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.document_secondary"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
